<template>
  <section class="all-text">
    <Title info="ماهي البرمجة" />
    <Text info="البرمجة هي عملية كتابة تعليمات وتوجيه أوامر لجهاز الحاسوب أو أي جهاز آخر مثل قارئات أقراص الدي في دي أو أجهزة استقبال الصوت والصورة في نظم الاتصالات الحديثة، لتوجيه هذا الجهاز وإعلامه بكيفية التعامل مع البيانات أو كيفية تنفيذ سلسلة من الأعمال المطلوبة تسمى خوارزمية."/>
    <Text info="وتتبع عملية البرمجة قواعد خاصة باللغة التي اختارها المبرمج، وكل لغة برمجة لها خصائصها التي تميزها عن الأخرى وتجعلها مناسبة بدرجات متفاوتة لكل نوع من أنواع البرامج وحسب المهمة المطلوبة من هذا البرنامج، كما أن اللغات البرمجية أيضا لها خصائص مشتركة وحدود مشتركة بحكم أن كل هذه اللغات صممت للتعامل مع الحاسوب."/>

    <Title info="مسارات و تخصصات البرمجة" />
    <Text info="البرمجة هي علم كبير مثل الطب و هي ايضا تنقسم لمجالات و مسارات كثيرة كما ايضا انها تمتلك عدة لغات برمجية، هناك من يبدأ بتعلم البرمجة بإختيار المسار وأتباع خطته و هذا تعليم ذاتي او البدأ بالطريقة الأكاديمية و المتبعة في الجامعات و التي يكون اساسها علوم الكمبيوتر و البيانات و الخوارزميات و الحساب مع احد لغات البرمجة التي يمكن التطبيق عليها." />
    <Note info='في موقع "مرجعي" نحن سنتطرق الى طريقة التعلم الذاتية التي سيحتاجها كل من درس بالجامعة او لم يدرس، و تعتمد الطريقة على ان تختار المسار ثم تتبع خطة التعلم الخاصة به و تتبع المحاور و الدورات لتصل لمرحلة الاحتراف بالتطبيق، اما الاساسيات فإننا سنتطرق لها في فواصل معينة فقط و ذلك بسبب ان مرجع الاساسيات لا يمكن تعويضه بدون الجامعة.'/>
    <Alert info="عليك ان تعلم انه يقصد بالأساسيات اساسيات علوم الكمبيوتر مثل قواعد البيانات و الخوارزميات و ان عدم تعلمها لا يعتبر عائق على مسار التعلم الخاص بك." />
    
    <Title info="قبل البدأ" />
    <Text info="كما ذكرنا في الملاحظة السابقة اننا سنتطرق الى الامور الأكاديمية و الاساسية في فترات معينة فقط وكمعلومات متوسطة و تستطيع البدأ من هنا، وتذكر هذا مجرد اساسيات وهي اختياري و يضل بإمكانك الانتقال الى المسار بدون المرور بكل هذا المحتوى التالي: هو تعلم اساسيات البرمجة و الخوارزميات والبيانات." />
    <Note info="اذا كنت ستختار مسار برمجة التطبيقات يستحسن المرور وأخذ نبذة عنهم ذلك لانه في المستقبل ستواجهك بعض المشاكل التي تجعلك مجبر على العودة الى البداية." />
    <Text info="يمكنك البدأ من هنا:" />


    <!-- START BOX FOR COURSE  -->
    <div class="box-list-crs">
      <!-- 
        fas fa-file-alt - icon file
        fas fa-play-circle - icon play video
        fas fa-life-ring - icon for support 
      -->
      <InfoCourse 
        title = "الدورات الأساسية"
        info = "يمكنك من الاسفل اختيار الدورة او المحتوى و البدا"
      />

      <div class="all-crs">
        <!-- START ONE COURSE -->

        <AddCourse
          link = "https://www.youtube.com/playlist?list=PLnrlZUDQofUv7JE4QIahAyztrQU9bnJmd"
          img = "/assets/img/icon-learn/cs5.jpg"
          title = "CS5 بالعربية"
          icon = "fas fa-play-circle"
        />
        <AddCourse
          link = "https://harmash.com/tutorials/algorithms/introduction"
          img = "/assets/img/icon-learn/harmash.jpg"
          title = "دورة خوارزميات نصية"
          icon = "fas fa-file-alt"
        />
        <AddCourse
          link = "https://www.youtube.com/playlist?list=PLCInYL3l2AajqOUW_2SwjWeMwf4vL4RSp"
          img = "/assets/img/icon-learn/data.jpg"
          title = "دورة تراكيب البيانات"
          icon = "fas fa-play-circle"
        />
        <!-- END ONE COURSE  -->

      </div>
    </div>
    <!-- END BOX COURSE  -->

    <Title info="قائمة المسارات" />
    <Text info="قائمة المسارات هي قائمة تحتوي على أغلب او اشهر مسارات البرمجة، ستتمكن هنا من إختيار المسار ثم البدأ في إتباع خطته، كل مسار يحتوي على خطة لأهم الدورات التي يجب اتباعها و كل دورة ستحتوي على مصادر التعلم، و التي ستكون دورات كفيديوها او مستندات نصية، اختر مسارك الان من هنا:" />
    <Title info="اختيار المسار" />
    <Text info="اذا كنت قد مررت بالمراحل السابقة او كنت قد تجاوزتها، فإن في الاسفل ستجد قائمة بالمسارات للبدأ في تعلمهم، فقط اختر المسار الذي تريده والذي تحبه واضغط البدأ وستجد في صفحة المسار الخطة التي يجب عليك اتباعها:" />


    <Taglink title="برمجة مواقع الويب" 
      info="مسار يهتم بتطوير وبرمجة صفحات الويب من صفحات النزول الصغيرة الى المشاريع الضخمة" 
      link="/learn-web" 
      button="البدأ" 
    />
  </section>
</template>

<script>
import Title from '../../blog/TitleBlog.vue';
import Text from '../../blog/TextBlog.vue';
import Note from '../../blog/Note.vue';
import Alert from '../../blog/Alert.vue';
import Taglink from '../../blog/TagLink.vue';

//BOX COURSESE 
import AddCourse from '../../blog/boxcourses/AddCourse.vue';
import InfoCourse from '../../blog/boxcourses/InfoCourse.vue';

export default {
  name:'BlogText',
  components:{
    Title,
    Text,
    Note,
    Alert,
    Taglink,

    AddCourse,
    InfoCourse,
  }
}
</script>